# coding=UTF8

# Корректирующий множитель для таймаута SNMP-операций. Чем медленнее CPU устройства, тем больше должен быть множитель.
# Этот параметр используется (если задан) для swtoolz-core. Остальные параметры целиком определяются пользователем.
timeout_mf = 1.0

# Карта портов устройства. Представлена в виде списков слотов. Каждый слот содержит список рядов.
# Каждый ряд содержит список портов.
DeviceMap = ([
                 [
                     ['0/0/0', '0/0/1', '0/0/2', '0/0/3', '0/0/4', '0/0/5', '0/0/6', '0/0/7', '0/0/8', '0/0/9',
                      '0/0/10', '0/0/11', '0/0/12', '0/0/13', '0/0/14', '0/0/15']
                 ],
                 [
                     ['0/1/0', '0/1/1', '0/1/2', '0/1/3', '0/1/4', '0/1/5', '0/1/6', '0/1/7', '0/1/8', '0/1/9',
                      '0/1/10', '0/1/11', '0/1/12', '0/1/13', '0/1/14', '0/1/15']
                 ],
                 [
                     ['0/2/0', '0/2/1', '0/2/2', '0/2/3', '0/2/4', '0/2/5', '0/2/6', '0/2/7', '0/2/8', '0/2/9',
                      '0/2/10', '0/2/11', '0/2/12', '0/2/13', '0/2/14', '0/2/15']
                 ],
                 [
                     ['0/3/0', '0/3/1', '0/3/2', '0/3/3', '0/3/4', '0/3/5', '0/3/6', '0/3/7', '0/3/8', '0/3/9',
                      '0/3/10', '0/3/11', '0/3/12', '0/3/13', '0/3/14', '0/3/15']
                 ],
             ],)

# SlotSize - количество индексов, отведенное на слот.
# Обычно это 64, то есть слот №1 - 1..64, слот №2 - 65..128, слот №3 - 129..192 и так далее.
# ShiftIndex - смещение, которое нужно прибавить к индексу. У некоторых устройств первый индекс может начинаться,
# например, с 256.
# MaxIndex - Максимальный индекс, который нужно обработать. Индексы с большими номерами игнорируются.
StackInfo = ({
                 'SlotSize': '0',
                 'ShiftIndex': '0',
             },)

# Список рекомендуемых команд
Commands = ([
                'DeviceMap',
                'walk_PortIndex',
                'walk_BoardDescr'
            ],)

walk_PortIndex = {
    # PortIndex   .1.3.6.1.2.1.2.2.1.1  ifIndex
    'PortIndex': '.1.3.6.1.2.1.2.2.1.1',
}

walk_BoardDescr = {
    # BoardBescr   .1.3.6.1.4.1.2011.6.3.3.2.1.3    hwSlotDesc
    'BoardDescr': '.1.3.6.1.4.1.2011.6.3.3.2.1.3',
}

walk_VlanMap = {
    # VLanId   .1.3.6.1.4.1.2011.5.6.1.1.1.1   hwVlanIndex
    'VLanId': '.1.3.6.1.4.1.2011.5.6.1.1.1.1',
    # VLanName   .1.3.6.1.4.1.2011.5.6.1.1.1.2    hwVlanDescription
    'VLanName': '.1.3.6.1.4.1.2011.5.6.1.1.1.2',
    # VlanPorts   .1.3.6.1.4.1.2011.5.6.1.1.1.3  hwVlanPorts
    'VlanPorts': '.1.3.6.1.4.1.2011.5.6.1.1.1.3',
}

create_vlan = [
    # .1.3.6.1.4.1.2011.5.6.1.1.1.4 hwVlanType
    ['.1.3.6.1.4.1.2011.5.6.1.1.1.4.{1}', '{1}', 7, 'INTEGER'],
    #  .1.3.6.1.4.1.2011.5.6.1.1.1.2     hwVlanDescription
    [' .1.3.6.1.4.1.2011.5.6.1.1.1.2.{1}', '{1}', '{2}', 'OCTETSTR'],
    # .1.3.6.1.4.1.2011.5.6.1.1.1.13  hwVlanRowStatus
    ['.1.3.6.1.4.1.2011.5.6.1.1.1.13.{1}', '{1}', 4, 'INTEGER'],
]
