# coding=UTF8
# Строчка выше нужна на случай использования Non-ASCII символов, например кириллицы.

# Корректирующий множитель для таймаута SNMP-операций. Чем медленнее CPU устройства, тем больше должен быть множитель.
# Этот параметр используется (если задан) для swtoolz-core. Остальные параметры целиком определяются пользователем.
timeout_mf = 15.2

# Карта портов устройства. Представлена в виде списков слотов. Каждый слот содержит список рядов. Каждый ряд содержит список портов.
DeviceMap = ([
    [
	['1/1','1/2','1/3','1/4'],
	['2/1','2/2','2/3','2/4'],
	['3/1','3/2','3/3','3/4'],
	['4/1','4/2','4/3','4/4'],
	['5/1','5/2','5/3','5/4'],
	['6/1','6/2','6/3','6/4'],
	['7/1','7/2','7/3','7/4'],
	['8/1']
    ],
    ],)

# SlotSize - количество индексов, отведенное на слот. Обычно это 64, то есть слот №1 - 1..64, слот №2 - 65..128, слот №3 - 129..192 и так далее.
# ShiftIndex - смещение, которое нужно прибавить к индексу. У некоторых устройств первый индекс может начинаться, например, с 256.
# MaxIndex - Максимальный индекс, который нужно обработать. Индексы с большими номерами игнорируются.
StackInfo = ({
    'SlotSize'   : '4',
    'ShiftIndex' : '0',
#    'MaxIndex'   : '29',
    },)

# Список рекомендуемых команд
Commands = ([
    'DeviceMap',
    'StackInfo',
    'MediumType',
    'ActualStatus',
    'ActualSpeed',
    'AdminStatus',
    'AdminSpeed',
    'AdminFlow',
    'BoardDescr',
    'PortIndex',
    'PortName',
    'PortDescr',
    ],)

# ifType
MediumType = ({
    '1' : 'other',
    '6' : 'fiber',
    '24': 'loopback',
    '53': 'virtual',
    },)

# ifOperStatus
ActualStatus = ({
    '1' : 'linkup',
    '2' : 'linkdown',
    '3' : 'testing',
    '4' : 'unknown',
    '5' : 'dormant',
    '6' : 'notPresent',
    '7' : 'lowerLayerDown',
    },)

# ifHighSpeed
ActualSpeed = ({
    '0'    : 'linkdown',
    '10'   : '10M',
    '100'  : '100M',
    '1000' : '1G',
    '10000': '10G',
    },)

# ifAdminStatus
AdminStatus = ({
    '1' : 'enabled',
    '2' : 'disabled',
    '3' : 'testing',
    },)

# ifType (placeholder)
AdminSpeed = ({
    '0'    : 'linkdown',
    '10'   : '10M',
    '100'  : '100M',
    '1000' : '1G',
    '10000': '10G',
    },)

# ifType (placeholder)
AdminFlow = ({
    '1' : 'disabled',
    '6' : 'disabled',
    '24': 'disabled',
    '53': 'disabled',
    },)

# UnitModuleName (placeholder)
BoardDescr = ({
    '1' : '10ge-4-port',
    '2' : '10ge-4-port',
    '3' : '10ge-4-port',
    '4' : '10ge-4-port',
    '5' : '10ge-4-port',
    '6' : '10ge-4-port',
    },)

# get_HardwareRev (placeholder for Slava's Hardcode. not working but necessary)
get_HardwareRev = ({
    '0' : 'n/a',
    },)

# walk_VlanEgressPorts (placeholder for Slava's Hardcode. not working but necessary)
walk_VlanEgressPorts = ({
    '0' : '',
    },)

PortIndex = ({
#    PortIndex           .1.3.6.1.2.1.2.2.1.1			ifIndex
#    'PortIndex'       : '.1.3.6.1.2.1.2.2.1.1',
        "1": "1",
        "2": "2",
        "3": "3",
        "4": "4",
        "5": "5",
        "6": "6",
        "7": "7",
        "8": "8",
        "9": "9",
        "10":"10",
        "11":"11",
        "12":"12",
        "13":"13",
        "14":"14",
        "15":"15",
        "16":"16",
        "17":"17",
        "18":"18",
        "19":"19",
        "20":"20",
        "21":"21",
        "22":"22",
        "23":"23",
        "24":"24",
    },)



PortName = ({
#    PortIndex           .1.3.6.1.2.1.2.2.1.1			ifIndex
#    'PortIndex'       : '.1.3.6.1.2.1.2.2.1.1',
        "1": "1/1",
        "2": "1/2",
        "3": "1/3",
        "4": "1/4",
        "5": "2/1",
        "6": "2/2",
        "7": "2/3",
        "8": "2/4",
        "9": "3/1",
        "10":"3/2",
        "11":"3/3",
        "12":"3/4",
        "13":"4/1",
        "14":"4/2",
        "15":"4/3",
        "16":"4/4",
        "17":"5/1",
        "18":"5/2",
        "19":"5/3",
        "20":"5/4",
        "21":"6/1",
        "22":"6/2",
        "23":"6/3",
        "24":"6/4",
    },)








get_SinglePort = {
#    MediumType          .1.3.6.1.2.1.2.2.1.3			ifType
    'MediumType.'     : '.1.3.6.1.2.1.2.2.1.3.%s',
#    ActualStatus        .1.3.6.1.2.1.2.2.1.8			ifOperStatus
    'ActualStatus.'   : '.1.3.6.1.2.1.2.2.1.8.%s',
#    ActualSpeed         .1.3.6.1.2.1.31.1.1.1.15		ifHighSpeed
    'ActualSpeed.'    : '.1.3.6.1.2.1.31.1.1.1.15.%s',
#    AdminStatus         .1.3.6.1.2.1.2.2.1.7			ifAdminStatus
    'AdminStatus.'    : '.1.3.6.1.2.1.2.2.1.7.%s',
#    AdminSpeed          .1.3.6.1.2.1.2.2.1.3			ifType (placeholder)
#    'AdminSpeed.'     : '.1.3.6.1.2.1.2.2.1.3.%s',
#    AdminFlow           .1.3.6.1.2.1.2.2.1.3			ifType (placeholder)
#    'AdminFlow.'      : '.1.3.6.1.2.1.2.2.1.3.%s',
#    PortDescr           .1.3.6.1.2.1.31.1.1.1.18		ifAlias
    'PortDescr.'      : '.1.3.6.1.2.1.31.1.1.1.18.%s',
    }

walk_AllPorts = {
    'helper':  'make_redback_ports',
#    MediumType          .1.3.6.1.2.1.2.2.1.3			ifType
#    ActualStatus        .1.3.6.1.2.1.2.2.1.8			ifOperStatus
##    'ActualStatus'    : '.1.3.6.1.2.1.2.2.1.8',
#    ActualSpeed         .1.3.6.1.2.1.31.1.1.1.15		ifHighSpeed
##    'ActualSpeed'     : '.1.3.6.1.2.1.31.1.1.1.15',
#    AdminStatus         .1.3.6.1.2.1.2.2.1.7			ifAdminStatus
##    'AdminStatus'     : '.1.3.6.1.2.1.2.2.1.7',
#    AdminSpeed          .1.3.6.1.2.1.2.2.1.3			ifType (placeholder)
#    'AdminSpeed'      : '.1.3.6.1.2.1.2.2.1.3',
#    AdminFlow           .1.3.6.1.2.1.2.2.1.3			ifType (placeholder)
#    'AdminFlow'       : '.1.3.6.1.2.1.2.2.1.3',
    'ActualStatus.1'    : '.1.3.6.1.2.1.2.2.1.8.1',
    'ActualStatus.2'    : '.1.3.6.1.2.1.2.2.1.8.2',
    'ActualStatus.3'    : '.1.3.6.1.2.1.2.2.1.8.3',
    'ActualStatus.4'    : '.1.3.6.1.2.1.2.2.1.8.4',
    'ActualStatus.5'    : '.1.3.6.1.2.1.2.2.1.8.5',
    'ActualStatus.6'    : '.1.3.6.1.2.1.2.2.1.8.6',
    'ActualStatus.7'    : '.1.3.6.1.2.1.2.2.1.8.7',
    'ActualStatus.8'    : '.1.3.6.1.2.1.2.2.1.8.8',
    'ActualStatus.9'    : '.1.3.6.1.2.1.2.2.1.8.9',
    'ActualStatus.10'    : '.1.3.6.1.2.1.2.2.1.8.10',
    'ActualStatus.11'    : '.1.3.6.1.2.1.2.2.1.8.11',
    'ActualStatus.12'    : '.1.3.6.1.2.1.2.2.1.8.12',
    'ActualStatus.13'    : '.1.3.6.1.2.1.2.2.1.8.13',
    'ActualStatus.14'    : '.1.3.6.1.2.1.2.2.1.8.14',
    'ActualStatus.15'    : '.1.3.6.1.2.1.2.2.1.8.15',
    'ActualStatus.16'    : '.1.3.6.1.2.1.2.2.1.8.16',
    'ActualStatus.17'    : '.1.3.6.1.2.1.2.2.1.8.17',
    'ActualStatus.18'    : '.1.3.6.1.2.1.2.2.1.8.18',
    'ActualStatus.19'    : '.1.3.6.1.2.1.2.2.1.8.19',
    'ActualStatus.20'    : '.1.3.6.1.2.1.2.2.1.8.20',
    'ActualStatus.21'    : '.1.3.6.1.2.1.2.2.1.8.21',
    'ActualStatus.22'    : '.1.3.6.1.2.1.2.2.1.8.22',
    'ActualStatus.23'    : '.1.3.6.1.2.1.2.2.1.8.23',
    'ActualStatus.24'    : '.1.3.6.1.2.1.2.2.1.8.24',
    'ActualSpeed.1'     : '.1.3.6.1.2.1.31.1.1.1.15.1',
    'ActualSpeed.2'     : '.1.3.6.1.2.1.31.1.1.1.15.2',
    'ActualSpeed.3'     : '.1.3.6.1.2.1.31.1.1.1.15.3',
    'ActualSpeed.4'     : '.1.3.6.1.2.1.31.1.1.1.15.4',
    'ActualSpeed.5'     : '.1.3.6.1.2.1.31.1.1.1.15.5',
    'ActualSpeed.6'     : '.1.3.6.1.2.1.31.1.1.1.15.6',
    'ActualSpeed.7'     : '.1.3.6.1.2.1.31.1.1.1.15.7',
    'ActualSpeed.8'     : '.1.3.6.1.2.1.31.1.1.1.15.8',
    'ActualSpeed.9'     : '.1.3.6.1.2.1.31.1.1.1.15.9',
    'ActualSpeed.10'     : '.1.3.6.1.2.1.31.1.1.1.15.10',
    'ActualSpeed.11'     : '.1.3.6.1.2.1.31.1.1.1.15.11',
    'ActualSpeed.12'     : '.1.3.6.1.2.1.31.1.1.1.15.12',
    'ActualSpeed.13'     : '.1.3.6.1.2.1.31.1.1.1.15.13',
    'ActualSpeed.14'     : '.1.3.6.1.2.1.31.1.1.1.15.14',
    'ActualSpeed.15'     : '.1.3.6.1.2.1.31.1.1.1.15.15',
    'ActualSpeed.16'     : '.1.3.6.1.2.1.31.1.1.1.15.16',
    'ActualSpeed.17'     : '.1.3.6.1.2.1.31.1.1.1.15.17',
    'ActualSpeed.18'     : '.1.3.6.1.2.1.31.1.1.1.15.18',
    'ActualSpeed.19'     : '.1.3.6.1.2.1.31.1.1.1.15.19',
    'ActualSpeed.20'     : '.1.3.6.1.2.1.31.1.1.1.15.20',
    'ActualSpeed.21'     : '.1.3.6.1.2.1.31.1.1.1.15.21',
    'ActualSpeed.22'     : '.1.3.6.1.2.1.31.1.1.1.15.22',
    'ActualSpeed.23'     : '.1.3.6.1.2.1.31.1.1.1.15.23',
    'ActualSpeed.24'     : '.1.3.6.1.2.1.31.1.1.1.15.24',
    'AdminStatus.1'     : '.1.3.6.1.2.1.2.2.1.7.1',
    'AdminStatus.2'     : '.1.3.6.1.2.1.2.2.1.7.2',
    'AdminStatus.3'     : '.1.3.6.1.2.1.2.2.1.7.3',
    'AdminStatus.4'     : '.1.3.6.1.2.1.2.2.1.7.4',
    'AdminStatus.5'     : '.1.3.6.1.2.1.2.2.1.7.5',
    'AdminStatus.6'     : '.1.3.6.1.2.1.2.2.1.7.6',
    'AdminStatus.7'     : '.1.3.6.1.2.1.2.2.1.7.7',
    'AdminStatus.8'     : '.1.3.6.1.2.1.2.2.1.7.8',
    'AdminStatus.9'     : '.1.3.6.1.2.1.2.2.1.7.9',
    'AdminStatus.10'     : '.1.3.6.1.2.1.2.2.1.7.10',
    'AdminStatus.11'     : '.1.3.6.1.2.1.2.2.1.7.11',
    'AdminStatus.12'     : '.1.3.6.1.2.1.2.2.1.7.12',
    'AdminStatus.13'     : '.1.3.6.1.2.1.2.2.1.7.13',
    'AdminStatus.14'     : '.1.3.6.1.2.1.2.2.1.7.14',
    'AdminStatus.15'     : '.1.3.6.1.2.1.2.2.1.7.15',
    'AdminStatus.16'     : '.1.3.6.1.2.1.2.2.1.7.16',
    'AdminStatus.17'     : '.1.3.6.1.2.1.2.2.1.7.17',
    'AdminStatus.18'     : '.1.3.6.1.2.1.2.2.1.7.18',
    'AdminStatus.19'     : '.1.3.6.1.2.1.2.2.1.7.19',
    'AdminStatus.20'     : '.1.3.6.1.2.1.2.2.1.7.20',
    'AdminStatus.21'     : '.1.3.6.1.2.1.2.2.1.7.21',
    'AdminStatus.22'     : '.1.3.6.1.2.1.2.2.1.7.22',
    'AdminStatus.23'     : '.1.3.6.1.2.1.2.2.1.7.23',
    'AdminStatus.24'     : '.1.3.6.1.2.1.2.2.1.7.24',
    'PortDescr.1'       : '.1.3.6.1.2.1.31.1.1.1.18.1',
    'PortDescr.2'       : '.1.3.6.1.2.1.31.1.1.1.18.2',
    'PortDescr.3'       : '.1.3.6.1.2.1.31.1.1.1.18.3',
    'PortDescr.4'       : '.1.3.6.1.2.1.31.1.1.1.18.4',
    'PortDescr.5'       : '.1.3.6.1.2.1.31.1.1.1.18.5',
    'PortDescr.6'       : '.1.3.6.1.2.1.31.1.1.1.18.6',
    'PortDescr.7'       : '.1.3.6.1.2.1.31.1.1.1.18.7',
    'PortDescr.8'       : '.1.3.6.1.2.1.31.1.1.1.18.8',
    'PortDescr.9'       : '.1.3.6.1.2.1.31.1.1.1.18.9',
    'PortDescr.10'       : '.1.3.6.1.2.1.31.1.1.1.18.10',
    'PortDescr.11'       : '.1.3.6.1.2.1.31.1.1.1.18.11',
    'PortDescr.12'       : '.1.3.6.1.2.1.31.1.1.1.18.12',
    'PortDescr.13'       : '.1.3.6.1.2.1.31.1.1.1.18.13',
    'PortDescr.14'       : '.1.3.6.1.2.1.31.1.1.1.18.14',
    'PortDescr.15'       : '.1.3.6.1.2.1.31.1.1.1.18.15',
    'PortDescr.16'       : '.1.3.6.1.2.1.31.1.1.1.18.16',
    'PortDescr.17'       : '.1.3.6.1.2.1.31.1.1.1.18.17',
    'PortDescr.18'       : '.1.3.6.1.2.1.31.1.1.1.18.18',
    'PortDescr.19'       : '.1.3.6.1.2.1.31.1.1.1.18.19',
    'PortDescr.20'       : '.1.3.6.1.2.1.31.1.1.1.18.20',
    'PortDescr.21'       : '.1.3.6.1.2.1.31.1.1.1.18.21',
    'PortDescr.22'       : '.1.3.6.1.2.1.31.1.1.1.18.22',
    'PortDescr.23'       : '.1.3.6.1.2.1.31.1.1.1.18.23',
    'PortDescr.24'       : '.1.3.6.1.2.1.31.1.1.1.18.24',

    }

PortDescr = {
#    PortDescr           .1.3.6.1.2.1.31.1.1.1.18		ifAlias
    'PortDescr.1'       : '.1.3.6.1.2.1.31.1.1.1.18.1',
    'PortDescr.2'       : '.1.3.6.1.2.1.31.1.1.1.18.2',
    'PortDescr.3'       : '.1.3.6.1.2.1.31.1.1.1.18.3',
    'PortDescr.4'       : '.1.3.6.1.2.1.31.1.1.1.18.4',
    'PortDescr.5'       : '.1.3.6.1.2.1.31.1.1.1.18.5',
    'PortDescr.6'       : '.1.3.6.1.2.1.31.1.1.1.18.6',
    'PortDescr.7'       : '.1.3.6.1.2.1.31.1.1.1.18.7',
    'PortDescr.8'       : '.1.3.6.1.2.1.31.1.1.1.18.8',
    'PortDescr.9'       : '.1.3.6.1.2.1.31.1.1.1.18.9',
    'PortDescr.10'       : '.1.3.6.1.2.1.31.1.1.1.18.10',
    'PortDescr.11'       : '.1.3.6.1.2.1.31.1.1.1.18.11',
    'PortDescr.12'       : '.1.3.6.1.2.1.31.1.1.1.18.12',
    'PortDescr.13'       : '.1.3.6.1.2.1.31.1.1.1.18.13',
    'PortDescr.14'       : '.1.3.6.1.2.1.31.1.1.1.18.14',
    'PortDescr.15'       : '.1.3.6.1.2.1.31.1.1.1.18.15',
    'PortDescr.16'       : '.1.3.6.1.2.1.31.1.1.1.18.16',
    'PortDescr.17'       : '.1.3.6.1.2.1.31.1.1.1.18.17',
    'PortDescr.18'       : '.1.3.6.1.2.1.31.1.1.1.18.18',
    'PortDescr.19'       : '.1.3.6.1.2.1.31.1.1.1.18.19',
    'PortDescr.20'       : '.1.3.6.1.2.1.31.1.1.1.18.20',
    'PortDescr.21'       : '.1.3.6.1.2.1.31.1.1.1.18.21',
    'PortDescr.22'       : '.1.3.6.1.2.1.31.1.1.1.18.22',
    'PortDescr.23'       : '.1.3.6.1.2.1.31.1.1.1.18.23',
    'PortDescr.24'       : '.1.3.6.1.2.1.31.1.1.1.18.24',
    }
